name: 'FcTestNetwork' 
layer { 
  name: 'data' 
  type: 'DummyData' 
  dummy_data_param { 
    shape { 
      dim: 1
      dim: 64
      dim: 112 
      dim: 112 
    } 
    data_filler { 
      type: 'gaussian' 
      std: 0.01 
    } 
  } 
  top: 'data' 
}
layer {
  name: "htanh"
  type: 'HTanH' 
  bottom: "data"
  top: "htanh"
}
