name: "DigitInputNet"
layers {
  name: "data"
  type: IMAGE_DATA
  top: "data"
  top: "label"
  image_data_param {
    source: "input/digit_list.txt"
    batch_size: 1
    new_height: 28
    new_width: 28
  }
}
