name: "FaceInputNet"
layers {
  name: "data"
  type: IMAGE_DATA
  top: "data"
  top: "label"
  image_data_param {
    source: "input/face_list.txt"
    batch_size: 1
    new_height: 152
    new_width: 152
  }
}
