name: "IMCInputNet"
layers {
  name: "data"
  type: IMAGE_DATA
  top: "data"
  top: "label"
  image_data_param {
    source: "input/imc_list.txt"
    batch_size: 1
    new_height: 256
    new_width: 256
  }
  transform_param {
    crop_size: 227
    mean_file: "data/imagenet_mean.binaryproto"
    mirror: false
  }
}
